<?php

return [

    'are_you_sure_change'                     => 'Подтверждение изменение',
    'are_you_sure_change_status_order'        => 'Вы действительно хотите изменить статус заказа?',
    'wrong_saving'                            => 'Ошибка запиcи в БД',
    'successful_buying'                       => 'Ваш заказ был успешно выполнен. Спасибо!',
    'wrong_adding_product_to_basket'          => 'Ошибка добавления товара в корзину',
    'successful_save'                         => 'Информация была успешно сохранена',
    'successful_add_to_basket'                => 'Товар был успешно добавлен в корзину',
    'are_you_sure'                            => 'Подтверждение удаления',
    'are_you_sure_delete_admin'               => 'Вы действительно хотите удалить пользователя?',
    'are_you_sure_delete_image'               => 'Вы действительно хотите удалить фото?',
    'are_you_sure_delete_record'              => 'Вы действительно хотите удалить запись?',
    'successful_remove_product'               => 'Товар был успешно удален с корзины',
    'wrong_remove_product'                    => 'Ошибка удаления товара с корзины',
    'are_you_sure_delete_product_from_basket' => 'Вы действительно хотите удалить товар с корзины',
    'not_enough_balance'                      => 'Недостаточно средств на счету',
    'invalid_discount_type'                   => 'Невозможно определить скидку',
    'email_not_exist'                         => 'Пользователя с данным Email-адресом не найдено',
    'we_sent_forget_password_letter'          => 'Мы отправили письмо на Вашу электронную почту с дальнейшими ' .
        'инструкциями, проверьте ваш почтовый ящик, чтобы узнать, как сбросить пароль',
    'password_recovery_message'               => '<p> Привет: :name</p><p>Мы получили запрос на восстановление ' .
        'пароля для этого письма. Перейдите по следующей ссылке, чтобы установить новый пароль:</p> ' .
        '<p><a href=":link"> Установите новый пароль</a></p><p>Если вы не выполняли этот запрос, ' .
        'игнорируйте это письмо.</p>',
    'password_recovery_for'                   => 'Восстановление пароля для <strong>:email</strong>. Введите новый ' .
        'пароль и подтвердите его, чтобы убедиться, что вы вводите его без ошибок.',
    'password_recovery_successful'            => 'Ваш пароль был сброшен. Используйте новый пароль для входа',
    'no_user_found'                           => 'Пользователя не найдено',
    'no_admin_found'                          => 'Пользователя не найдено',
    'inspired_token'                          => 'Токен недействителен или просрочен. Пожалуйста, попробуйте ' .
        'сделать новый запрос на востановление пароля',
    'admin_invite_message'                    => '<p> Привет: :name</p><p>Для Вас был создан профиль для ' .
        'управления системой. Пароль для входа: <b>:password</b>. Перейдите по следующей ссылке, чтобы установить свой пароль:</p> ' .
        '<p><a href=":link"> Сменить пароль</a></p>',

];
