<?php

return [

    'are_you_sure_change' => 'Підтвердження зміна',
    'are_you_sure_change_status_order' => 'Ви дійсно хочете змінити статус замовлення?',
    'wrong_saving' => 'Помилка запіcі в БД',
    'successful_buying' => 'Ваше замовлення було успішно виконано. Спасибі!',
    'wrong_adding_product_to_basket' => 'Помилка додавання товару в корзину',
    'successful_save' => 'Інформація була успішно збережена',
    'successful_add_to_basket' => 'Товар був успішно доданий до кошика',
    'are_you_sure' => 'Підтвердження видалення',
    'are_you_sure_delete_admin' => 'Ви дійсно хочете видалити користувача?',
    'are_you_sure_delete_image' => 'Ви дійсно хочете видалити фото?',
    'are_you_sure_delete_record' => 'Ви дійсно хочете видалити запис?',
    'successful_remove_product' => 'Товар був успішно видалений з кошика',
    'wrong_remove_product' => 'Помилка при вилученні товару з кошика',
    'are_you_sure_delete_product_from_basket' => 'Ви дійсно хочете видалити товар з кошика',
    'not_enough_balance' => 'Недостатньо коштів на рахунку',
    'invalid_discount_type' => 'Неможливо визначити знижку',
    'email_not_exist' => 'Користувача з даними Email-адресою, не знайдено',
    'we_sent_forget_password_letter' => 'Ми відправили лист на Вашу електронну пошту з подальшими ' .
        'інструкціями, перевірте вашу поштову скриньку, щоб дізнатися, як скинути пароль',
    'password_recovery_message' => '<p> Привіт:: name </p> <p> Ми отримали запит на відновлення' .
        'Пароля для цього листа. Перейдіть за наступним посиланням, щоб встановити новий пароль: </ p> ' .
        '<p> <a href=":link"> Встановіть новий пароль </a> </p> <p> Якщо ви не виконували цей запит,' .
        'ігноруйте цей лист. </p>',
    'password_recovery_for' => 'Відновлення пароля для <strong>: email </strong>. Введіть новий ' .
        'пароль і підтвердіть його, щоб переконатися, що ви вводите його без помилок.',
    'password_recovery_successful' => 'Ваш пароль був скинутий. Використовуйте новий пароль для входу ',
    'no_user_found' => 'Користувача, не знайдено',
    'no_admin_found' => 'Користувача, не знайдено',
    'inspired_token' => 'Токен недійсний або прострочений. Будь ласка, спробуйте ' .
        'зробити новий запит на відновлення пароля',
    'admin_invite_message' => '<p> Привіт:: name </p> <p> Для Вас був створений профіль для' .
        'Управління системою. Пароль для входу: <b>: password </b>. Перейдіть за наступним посиланням, щоб встановити свій пароль: </p> ' .
        '<p> <a href=":link"> Змінити пароль </a> </p>',

];
